_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 52)      1456      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 60)      28140     
_________________________________________________________________
block1_pool (MaxPooling2D)   multiple                  0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 122)     66002     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 125)     137375    
_________________________________________________________________
block2_pool (MaxPooling2D)   multiple                  0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 251)       282626    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 253)       571780    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 250)       569500    
_________________________________________________________________
block3_pool (MaxPooling2D)   multiple                  0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 510)       1148010   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 507)       2327637   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 505)       2304820   
_________________________________________________________________
block4_pool (MaxPooling2D)   multiple                  0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 506)       2300276   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 507)       2309385   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 507)       2313948   
_________________________________________________________________
block5_pool (MaxPooling2D)   multiple                  0         
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
fc1 (Dense)                  (None, 4095)              101736180 
_________________________________________________________________
fc2 (Dense)                  (None, 4087)              16740352  
_________________________________________________________________
predictions (Dense)          (None, 998)               4079824   
=================================================================
Total params: 136,917,311
Trainable params: 136,917,311
Non-trainable params: 0
_________________________________________________________________
